In [1]:
import numpy as np
import pandas as pd

In [2]:
 s = pd.Series([1, 3, 5, np.nan, 6, 8])
 s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range(20130101,periods=6)

In [4]:
dates

DatetimeIndex(['1970-01-01 00:00:00.020130101',
               '1970-01-02 00:00:00.020130101',
               '1970-01-03 00:00:00.020130101',
               '1970-01-04 00:00:00.020130101',
               '1970-01-05 00:00:00.020130101',
               '1970-01-06 00:00:00.020130101'],
              dtype='datetime64[ns]', freq='D')

In [5]:
 df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [6]:
df

                                      A         B         C         D
1970-01-01 00:00:00.020130101 -0.026401 -0.775873 -1.296309  0.852299
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  0.255029
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791 -0.240868
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176 -0.669759

In [7]:
df2 = pd.DataFrame(
   ...:     {
   ...:         "A": 1.0,
   ...:         "B": pd.Timestamp("20130102"),
   ...:         "C": pd.Series(1, index=list(range(4)), dtype="float32"),
   ...:         "D": np.array([3] * 4, dtype="int32"),
   ...:         "E": pd.Categorical(["test", "train", "test", "train"]),
   ...:         "F": "foo",
   ...:     }
   ...: )
   ...:

In [8]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df.head()

                                      A         B         C         D
1970-01-01 00:00:00.020130101 -0.026401 -0.775873 -1.296309  0.852299
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  0.255029
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791 -0.240868

In [12]:
df.tail()

                                      A         B         C         D
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  0.255029
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791 -0.240868
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176 -0.669759

In [13]:
df.index

DatetimeIndex(['1970-01-01 00:00:00.020130101',
               '1970-01-02 00:00:00.020130101',
               '1970-01-03 00:00:00.020130101',
               '1970-01-04 00:00:00.020130101',
               '1970-01-05 00:00:00.020130101',
               '1970-01-06 00:00:00.020130101'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.to_numpy()

array([[-0.02640067, -0.77587251, -1.29630915,  0.85229938],
       [ 1.13284622, -0.41497484, -2.48872741, -0.85054539],
       [-0.61230935,  1.28900853,  0.07027531, -0.20897566],
       [ 1.59810613,  0.9143152 , -0.7131795 ,  0.25502926],
       [-0.63330359, -0.39861721,  0.09879079, -0.24086777],
       [ 2.13854987,  0.74331117, -1.01317593, -0.66975906]])

In [18]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [19]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.599581  0.226195 -0.890388 -0.143803
std    1.185781  0.857452  0.966156  0.623068
min   -0.633304 -0.775873 -2.488727 -0.850545
25%   -0.465832 -0.410885 -1.225526 -0.562536
50%    0.553223  0.172347 -0.863178 -0.224922
75%    1.481791  0.871564 -0.125588  0.139028
max    2.138550  1.289009  0.098791  0.852299

In [21]:
df.T

,1970-01-01 00:00:00.020130101,1970-01-02 00:00:00.020130101,1970-01-03 00:00:00.020130101,1970-01-04 00:00:00.020130101,1970-01-05 00:00:00.020130101,1970-01-06 00:00:00.020130101
A,-0.026401,1.132846,-0.612309,1.598106,-0.633304,2.138550
B,-0.775873,-0.414975,1.289009,0.914315,-0.398617,0.743311
C,-1.296309,-2.488727,0.070275,-0.713180,0.098791,-1.013176
D,0.852299,-0.850545,-0.208976,0.255029,-0.240868,-0.669759

In [22]:
df.sort_index(axis=1, ascending=False)
# 1번째 열을 기준으로 내림차순

                                      D         C         B         A
1970-01-01 00:00:00.020130101  0.852299 -1.296309 -0.775873 -0.026401
1970-01-02 00:00:00.020130101 -0.850545 -2.488727 -0.414975  1.132846
1970-01-03 00:00:00.020130101 -0.208976  0.070275  1.289009 -0.612309
1970-01-04 00:00:00.020130101  0.255029 -0.713180  0.914315  1.598106
1970-01-05 00:00:00.020130101 -0.240868  0.098791 -0.398617 -0.633304
1970-01-06 00:00:00.020130101 -0.669759 -1.013176  0.743311  2.138550

In [23]:
df.sort_values(by="B")
# B 값으로 정렬 뒤에 뭐가 없으니 기본 값인 오름차순 정렬

                                      A         B         C         D
1970-01-01 00:00:00.020130101 -0.026401 -0.775873 -1.296309  0.852299
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791 -0.240868
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176 -0.669759
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  0.255029
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976

In [25]:
df.head()

                                      A         B         C         D
1970-01-01 00:00:00.020130101 -0.026401 -0.775873 -1.296309  0.852299
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  0.255029
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791 -0.240868

In [24]:
df["A"]

1970-01-01 00:00:00.020130101   -0.026401
1970-01-02 00:00:00.020130101    1.132846
1970-01-03 00:00:00.020130101   -0.612309
1970-01-04 00:00:00.020130101    1.598106
1970-01-05 00:00:00.020130101   -0.633304
1970-01-06 00:00:00.020130101    2.138550
Freq: D, Name: A, dtype: float64

In [26]:
df[0:3]

                                      A         B         C         D
1970-01-01 00:00:00.020130101 -0.026401 -0.775873 -1.296309  0.852299
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976

In [30]:
df["20130102":"20130104"]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [32]:
df.head()

                                      A         B         C         D
1970-01-01 00:00:00.020130101 -0.026401 -0.775873 -1.296309  0.852299
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  0.255029
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791 -0.240868

In [31]:
df.loc[dates[0]]

A   -0.026401
B   -0.775873
C   -1.296309
D    0.852299
Name: 1970-01-01 00:00:00.020130101, dtype: float64

In [33]:
df.loc[:, ["A", "B"]]

                                      A         B
1970-01-01 00:00:00.020130101 -0.026401 -0.775873
1970-01-02 00:00:00.020130101  1.132846 -0.414975
1970-01-03 00:00:00.020130101 -0.612309  1.289009
1970-01-04 00:00:00.020130101  1.598106  0.914315
1970-01-05 00:00:00.020130101 -0.633304 -0.398617
1970-01-06 00:00:00.020130101  2.138550  0.743311

In [38]:
df.loc["20130102":"20130104", ["A", "B"]]

Empty DataFrame
Columns: [A, B]
Index: []

In [35]:
df.loc[dates[0], "A"]

-0.026400669632077284

In [39]:
df.at[dates[0], "A"]

-0.026400669632077284

In [40]:
df.iloc[3]

A    1.598106
B    0.914315
C   -0.713180
D    0.255029
Name: 1970-01-04 00:00:00.020130101, dtype: float64

In [41]:
df

                                      A         B         C         D
1970-01-01 00:00:00.020130101 -0.026401 -0.775873 -1.296309  0.852299
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  0.255029
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791 -0.240868
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176 -0.669759

In [42]:
df.iloc[3:5, 0:2]

                                      A         B
1970-01-04 00:00:00.020130101  1.598106  0.914315
1970-01-05 00:00:00.020130101 -0.633304 -0.398617

In [43]:
df.iloc[[1, 2, 4], [0, 2]]

                                      A         C
1970-01-02 00:00:00.020130101  1.132846 -2.488727
1970-01-03 00:00:00.020130101 -0.612309  0.070275
1970-01-05 00:00:00.020130101 -0.633304  0.098791

In [44]:
df.iloc[1:3, :]

                                      A         B         C         D
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976

In [45]:
df.iloc[:, 1:3]

                                      B         C
1970-01-01 00:00:00.020130101 -0.775873 -1.296309
1970-01-02 00:00:00.020130101 -0.414975 -2.488727
1970-01-03 00:00:00.020130101  1.289009  0.070275
1970-01-04 00:00:00.020130101  0.914315 -0.713180
1970-01-05 00:00:00.020130101 -0.398617  0.098791
1970-01-06 00:00:00.020130101  0.743311 -1.013176

In [46]:
 df.iloc[1, 1]

-0.4149748404966933

In [47]:
df.iat[1, 1]

-0.4149748404966933

In [48]:
df

                                      A         B         C         D
1970-01-01 00:00:00.020130101 -0.026401 -0.775873 -1.296309  0.852299
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  0.255029
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791 -0.240868
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176 -0.669759

In [49]:
df[df["A"] > 0]

                                      A         B         C         D
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  0.255029
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176 -0.669759

In [50]:
df[df > 0]

                                      A         B         C         D
1970-01-01 00:00:00.020130101       NaN       NaN       NaN  0.852299
1970-01-02 00:00:00.020130101  1.132846       NaN       NaN       NaN
1970-01-03 00:00:00.020130101       NaN  1.289009  0.070275       NaN
1970-01-04 00:00:00.020130101  1.598106  0.914315       NaN  0.255029
1970-01-05 00:00:00.020130101       NaN       NaN  0.098791       NaN
1970-01-06 00:00:00.020130101  2.138550  0.743311       NaN       NaN

In [53]:
df2 = df.copy()
df2["E"] = ["one","one","two","three","four","three"]
df2

                                      A         B         C         D      E
1970-01-01 00:00:00.020130101 -0.026401 -0.775873 -1.296309  0.852299    one
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545    one
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976    two
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  0.255029  three
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791 -0.240868   four
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176 -0.669759  three

In [55]:
df2[df2["E"].isin(["two","four"])]

                                      A         B         C         D     E
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976   two
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791 -0.240868  four

In [67]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [58]:
df

                                      A         B         C         D
1970-01-01 00:00:00.020130101 -0.026401 -0.775873 -1.296309  0.852299
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727 -0.850545
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275 -0.208976
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  0.255029
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791 -0.240868
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176 -0.669759

In [68]:
df["F"] = s1
df

                                      A         B         C    D   F
1970-01-01 00:00:00.020130101  0.000000  0.000000 -1.296309  5.0 NaN
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727  5.0 NaN
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275  5.0 NaN
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  5.0 NaN
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791  5.0 NaN
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176  5.0 NaN

In [69]:
df.at[dates[0],"A"]=0  # 0번 째 날짜에 해당하는 행의 A열 = 0이다
df

                                      A         B         C    D   F
1970-01-01 00:00:00.020130101  0.000000  0.000000 -1.296309  5.0 NaN
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727  5.0 NaN
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275  5.0 NaN
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  5.0 NaN
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791  5.0 NaN
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176  5.0 NaN

In [70]:
df.iat[0,1] = 0  # 0번째와 1번째 해당하는 위치에 값을 0으로 넣는
df

                                      A         B         C    D   F
1970-01-01 00:00:00.020130101  0.000000  0.000000 -1.296309  5.0 NaN
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727  5.0 NaN
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275  5.0 NaN
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  5.0 NaN
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791  5.0 NaN
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176  5.0 NaN

In [64]:
df.loc[:,"D"] = np.array([5]*len(df))
#  D열에  5의 배열로 값 지정

                                      A         B         C    D   F
1970-01-01 00:00:00.020130101  0.000000  0.000000 -1.296309  5.0 NaN
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727  5.0 NaN
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275  5.0 NaN
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  5.0 NaN
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791  5.0 NaN
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176  5.0 NaN

In [71]:
df2 = df.copy()

In [72]:
df2[df2>0] = -df2
df

                                      A         B         C    D   F
1970-01-01 00:00:00.020130101  0.000000  0.000000 -1.296309  5.0 NaN
1970-01-02 00:00:00.020130101  1.132846 -0.414975 -2.488727  5.0 NaN
1970-01-03 00:00:00.020130101 -0.612309  1.289009  0.070275  5.0 NaN
1970-01-04 00:00:00.020130101  1.598106  0.914315 -0.713180  5.0 NaN
1970-01-05 00:00:00.020130101 -0.633304 -0.398617  0.098791  5.0 NaN
1970-01-06 00:00:00.020130101  2.138550  0.743311 -1.013176  5.0 NaN

In [74]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [75]:
df1.loc[dates[0] :dates[1], "E"] =1
DF1

NameError: name 'DF1' is not defined